# Practicle 4

### Consider two excel files having attendance of a workshop’s participants for two days. Each file has three
#### fields ‘Name’, ‘Time of joining’, duration (in minutes) where names are unique within a file. Note that duration
#### may take one of three values (30, 40, 50) only. Import the data into two dataframes and do the following:
#### a. Perform merging of the two dataframes to find the names of students who had attended the
#### workshop on both days.
#### b. Find names of all students who have attended workshop on either of the days.
#### c. Merge two data frames row-wise and find the total number of records in the data frame.
#### d. Merge two data frames and use two columns names and duration as multi-row indexes. Generate
#### descriptive statistics for this multi-index.

In [13]:
import pandas as pd
import numpy as np
import datetime

In [14]:
dict1 = {"Name":['vikas','vishal', 'uday', 'sid'],
         "Time of joining": [datetime.time(9,15), np.nan, datetime.time(9,5), np.nan],
         "duration":[30,0, 50, 0]}

In [15]:
dict2 = {"Name":['vikas','vishal', 'uday', 'sid'],
         "Time of joining": [datetime.time(9,20), datetime.time(9,25), np.nan, np.nan],
         "duration":[30,40,0, 0]}

In [16]:
data1 = pd.DataFrame(dict1)
data2 = pd.DataFrame(dict2)

display(data1, data2)

     Name Time of joining  duration
0   vikas        09:15:00        30
1  vishal             NaN         0
2    uday        09:05:00        50
3     sid             NaN         0

     Name Time of joining  duration
0   vikas        09:20:00        30
1  vishal        09:25:00        40
2    uday             NaN         0
3     sid             NaN         0

## a. Perform merging of the two dataframes to find the names of students who had attended the workshop on both days.

In [17]:
data = pd.concat([data1.dropna(), data2.dropna()],ignore_index=True)
data = data[data['Name'].isin(data1.dropna()['Name']) & data['Name'].isin(data2.dropna()['Name'])]

In [18]:
data['Name'].unique()

array(['vikas'], dtype=object)

## b. Find names of all students who have attended workshop on either of the days.

In [19]:
pd.concat([data1.dropna(), data2.dropna()],ignore_index=True)['Name']

0     vikas
1      uday
2     vikas
3    vishal
Name: Name, dtype: object

## c. Merge two data frames row-wise and find the total number of records in the data frame.

In [20]:
combinedata = pd.concat([data1, data2],ignore_index=True)
combinedata

     Name Time of joining  duration
0   vikas        09:15:00        30
1  vishal             NaN         0
2    uday        09:05:00        50
3     sid             NaN         0
4   vikas        09:20:00        30
5  vishal        09:25:00        40
6    uday             NaN         0
7     sid             NaN         0

In [21]:
print('total_records')
len(combinedata)

total_records

8

## d. Merge two data frames and use two columns names and duration as multi-row indexes. Generate descriptive statistics for this multi-index.

In [22]:
multirow_index_data = combinedata.set_index(['Name', 'duration'])

In [23]:
multirow_index_data.index

MultiIndex([( 'vikas', 30),
            ('vishal',  0),
            (  'uday', 50),
            (   'sid',  0),
            ( 'vikas', 30),
            ('vishal', 40),
            (  'uday',  0),
            (   'sid',  0)],
           names=['Name', 'duration'])

In [24]:
print("Original DataFrame:\n")
display(multirow_index_data)


# Describing descriptive statistics of Year
print("\nDescriptive statistics of data:\n")
stats = multirow_index_data['Time of joining'].describe()
print(stats)

Original DataFrame:

                Time of joining
Name   duration
vikas  30              09:15:00
vishal 0                    NaN
uday   50              09:05:00
sid    0                    NaN
vikas  30              09:20:00
vishal 40              09:25:00
uday   0                    NaN
sid    0                    NaN

Descriptive statistics of data:

count            4
unique           4
top       09:15:00
freq             1
Name: Time of joining, dtype: object